app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'billiyagi'
---
    public function index()
    {
        if ( !$this->validate([
            'username_in' => [
                'rules'     =>  'required',
                'errors'    =>  [
                    'required'  =>  'username diperlukan'
                ]
            ],
            'password_in' => [
                'rules'     =>  'required',
                'errors'    =>  [
                    'required'  =>  'password diperlukan'
                ]
            ]
        ]) ) {
            return $this->response->setJSON(['validation' => FALSE, $this->validator->getErrors()]);
        }

        $user = $this->user_model->where('username', $this->request->getPost('username_in'))->find();