app/Controllers/PostController.php

SELECT *
FROM `categories`
ORDER BY `category_id` DESC
---
    public function create()
    {
        $data = [
            'page_title'    =>  'Category',
            'categories'    =>  $this->category_model->orderBy('category_id', "DESC")->findAll(),