app/Controllers/ProfileController.php

    public function index()
    {
        $data = [
            'page_title'    =>  'Profile',
            'user'          =>  $this->user_model->find(session('user_session')['id'])
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'

        ];

        // Simpan data
        if ( $this->user_model->save($data) ) {
---
UPDATE `users` SET `first_name` = 'Febry', `last_name` = 'Billiyagi', `email` = 'todayismyday47@gmail.com', `avatar` = '1658115298_4f80ffcd9cb94e8d7d33.jpg', `updated_at` = '2022-07-18 10:34:58'
WHERE `users`.`user_id` IN ('2')

        }

        // Buat ulang sesi login
        user_session($this->user_model->find($this->request->getPost('id')));
---
SELECT *
FROM `users`
WHERE `users`.`user_id` = '2'